OpenNuvoton/NUC980_NonOS_BSP/SampleCode/USBD_VCOM_MSC/vcom_msc.c
    g_usbd_DmaDone = 0;
    USBD_ENABLE_DMA();

    while(g_u8MscStart)
    {
        if (g_usbd_DmaDone == 1)
            break;

        if (!USBD_IS_ATTACHED())
            break;
    }
}

void MSC_ProcessCmd(void)
{
    uint32_t i, count;

    if (g_u8BulkState == BULK_NORMAL)
    {
        g_u8BulkState = BULK_OUT;
        MSC_ReceiveCBW(g_u32MassBase);
    }

    if (g_u8BulkState == BULK_CBW)
    {
        /* Check Signature of CBW */
        if ((*(uint32_t *)(g_u32MassBase) != CBW_SIGNATURE))
        {
            g_u8BulkState = BULK_NORMAL;
            return;
        }

        /* Get the CBW */
        for (i = 0; i < 31; i++)
            *((uint8_t *) (&g_sCBW.dCBWSignature) + i) = *(uint8_t *)(g_u32MassBase + i);

        /* Prepare to echo the tag from CBW to CSW */
        g_sCSW.dCSWTag = g_sCBW.dCBWTag;

        /* Parse Op-Code of CBW */
        switch (g_sCBW.u8OPCode)
        {
        case UFI_READ_10:
        {
            /* Get LBA address */
            g_u32LbaAddress = get_be32(&g_sCBW.au8Data[0]);
            g_u32DataTransferSector = g_sCBW.dCBWDataTransferLength / USBD_SECTOR_SIZE;
            if (g_sCBW.dCBWDataTransferLength >= USBD_MAX_SD_LEN)
            {
                count = g_sCBW.dCBWDataTransferLength / USBD_MAX_SD_LEN;
                for (i=0; i<count; i++)
                {
                    MSC_ReadMedia(g_u32LbaAddress+i*USBD_MAX_SD_SECTOR, USBD_MAX_SD_SECTOR, (uint8_t *)g_u32StorageBase);
                    MSC_BulkIn(g_u32StorageBase, USBD_MAX_SD_LEN);
                }

                if ((g_sCBW.dCBWDataTransferLength % USBD_MAX_SD_LEN) != 0)
                {
                    MSC_ReadMedia(g_u32LbaAddress+i*USBD_MAX_SD_SECTOR, g_u32DataTransferSector % USBD_MAX_SD_SECTOR, (uint8_t *)g_u32StorageBase);
                    MSC_BulkIn(g_u32StorageBase, g_sCBW.dCBWDataTransferLength % USBD_MAX_SD_LEN);
                }
            }
            else
            {
                //--- read data from SD card address g_u32LbaAddress to buffer in SRAM (g_u32StorageBase).
                MSC_ReadMedia(g_u32LbaAddress, g_u32DataTransferSector, (uint8_t *)g_u32StorageBase);
                MSC_BulkIn(g_u32StorageBase, g_sCBW.dCBWDataTransferLength);
            }
            MSC_AckCmd(0);
            break;
        }
        case UFI_WRITE_10:
        {
            g_u32LbaAddress = get_be32(&g_sCBW.au8Data[0]);
            g_u32DataTransferSector = g_sCBW.dCBWDataTransferLength / USBD_SECTOR_SIZE;

            if (g_sCBW.dCBWDataTransferLength >= USBD_MAX_SD_LEN)
            {
                count = g_sCBW.dCBWDataTransferLength / USBD_MAX_SD_LEN;
                for (i=0; i<count; i++)
                {
                    MSC_BulkOut(g_u32StorageBase, USBD_MAX_SD_LEN);
                    MSC_WriteMedia(g_u32LbaAddress+i*USBD_MAX_SD_SECTOR, USBD_MAX_SD_SECTOR, (uint8_t *)g_u32StorageBase);
                }

                if ((g_sCBW.dCBWDataTransferLength % USBD_MAX_SD_LEN) != 0)
                {
                    MSC_BulkOut(g_u32StorageBase, g_sCBW.dCBWDataTransferLength % USBD_MAX_SD_LEN);
                    MSC_WriteMedia(g_u32LbaAddress+i*USBD_MAX_SD_SECTOR, g_u32DataTransferSector % USBD_MAX_SD_SECTOR, (uint8_t *)g_u32StorageBase);
                }
            }
            else
            {
                MSC_BulkOut(g_u32StorageBase, g_sCBW.dCBWDataTransferLength);
                //--- write data from buffer in SRAM (g_u32StorageBase) to SD card address g_u32LbaAddress.
                MSC_WriteMedia(g_u32LbaAddress, g_u32DataTransferSector, (uint8_t *)g_u32StorageBase);
            }
            MSC_AckCmd(0);
            break;
        }
        case UFI_PREVENT_ALLOW_MEDIUM_REMOVAL:
        {
            if (g_sCBW.au8Data[2] & 0x01)
            {
                g_au8SenseKey[0] = 0x05;  //INVALID COMMAND
                g_au8SenseKey[1] = 0x24;
                g_au8SenseKey[2] = 0;
                g_u8Prevent = 1;
            }
            else
                g_u8Prevent = 0;
            MSC_AckCmd(0);
            break;
        }
        case UFI_VERIFY_10:
        case UFI_START_STOP:
        case UFI_TEST_UNIT_READY:
        {
            MSC_AckCmd(0);
            break;
        }
        case UFI_REQUEST_SENSE:
        {
            MSC_RequestSense();
            MSC_AckCmd(0);
            break;
        }
        case UFI_READ_FORMAT_CAPACITY:
        {
            MSC_ReadFormatCapacity();
            MSC_AckCmd(0);
            break;
        }
        case UFI_READ_CAPACITY:
        {
            MSC_ReadCapacity();
            MSC_AckCmd(0);
            break;
        }
        case UFI_MODE_SELECT_10:
        {
            MSC_BulkOut(g_u32StorageBase, g_sCBW.dCBWDataTransferLength);
            MSC_AckCmd(0);
            break;
        }
        case UFI_MODE_SENSE_10:
        {
            MSC_ModeSense10();
            MSC_AckCmd(0);
            break;
        }
        case UFI_MODE_SENSE_6:
        {
            MSC_ModeSense6();
            MSC_AckCmd(0);
            break;
        }
        case UFI_INQUIRY:
        {
            /* Bulk IN buffer */
            USBD_MemCopy((uint8_t *)(g_u32MassBase), (uint8_t *)g_au8InquiryID, 36);
            MSC_BulkIn(g_u32MassBase, 36);
            MSC_AckCmd(g_sCBW.dCBWDataTransferLength - 36);
            break;
        }
        default:
        {
            /* Unsupported command */
            g_au8SenseKey[0] = 0x05;
            g_au8SenseKey[1] = 0x20;
            g_au8SenseKey[2] = 0x00;

            /* If CBW request for data phase, just return zero packet to end data phase */
            if (g_sCBW.dCBWDataTransferLength > 0)
                MSC_AckCmd(g_sCBW.dCBWDataTransferLength);
            else
                MSC_AckCmd(0);
        }
        }
    }
}

void MSC_ActiveDMA(uint32_t u32Addr, uint32_t u32Len)
{
    /* Enable BUS interrupt */
    USBD_ENABLE_BUS_INT(USBD_BUSINTEN_DMADONEIEN_Msk|USBD_BUSINTEN_SUSPENDIEN_Msk|USBD_BUSINTEN_RSTIEN_Msk|USBD_BUSINTEN_VBUSDETIEN_Msk);

    USBD_SET_DMA_ADDR(u32Addr);
    USBD_SET_DMA_LEN(u32Len);
    g_usbd_DmaDone = 0;
    USBD_ENABLE_DMA();
    while(g_u8MscStart)
    {
        if (g_usbd_DmaDone)
            break;

        if (!USBD_IS_ATTACHED())
            break;
    }
}

void MSC_AckCmd(uint32_t u32Residue)
{
    g_sCSW.dCSWDataResidue = u32Residue;
    g_sCSW.bCSWStatus = g_u8Prevent;
    if (SD0.IsCardInsert == 0)
    {
        if ((g_sCBW.u8OPCode == UFI_INQUIRY) || (g_sCBW.u8OPCode == UFI_REQUEST_SENSE))
            g_sCSW.bCSWStatus = 0x00;
        else
            g_sCSW.bCSWStatus = 0x01;
    }
    USBD_MemCopy((uint8_t *)g_u32MassBase, (uint8_t *)&g_sCSW.dCSWSignature, 16);
    MSC_BulkIn(g_u32MassBase, 13);
    g_u8BulkState = BULK_NORMAL;
}

void MSC_ReadMedia(uint32_t addr, uint32_t size, uint8_t *buffer)
{
    SDH_Read(SDH0, buffer, addr, size);
}

void MSC_WriteMedia(uint32_t addr, uint32_t size, uint8_t *buffer)
{
    SDH_Write(SDH0, buffer, addr, size);
}

